<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Document</title>
</head>
<body>
    <b>ฟังก์ชันที่ทำงานเกี่ยวกับตัวแปร</b>
    <p>1. isset คือฟังกืชั่นสำหรับตรวจสอบว่าตัวแปรมีการกำหนดค่าหรือไม่ ถ้ากำหนดจะมีค่าเป็น True(1) ถ้่าไม่กำหนดจะมีค่าเป็น False</p>
    <p>2. unset ยกเลิกตัวแปรและคืนค่าให้หน่วยความจำ</p>
    <p>3.empty ฟังก์ชั่นสำหรับตรวจสอบว่าตัวแปรมีค่าว่างหรือเลขศูนย์หรือไม่ถ้าเป็นค่าว่างจะเป็น True(1) ถ้าไม่เป็นค่าว่างจะเป็น False</p>
    <p>4.is_null ฟังก์ชั่นสำหรับตรวจสอบว่าตัวแปรมีค่าว่างหรือไม่</p>
    <p>5.print_r() ฟังก์ชั่นสำหรับแสดงค่าตัวแปรใน array</p>
    <p>6.var_dump() แสดงรายละเอียดตัวแปร</p>
<?php 

?>
    
</body>
</html>