<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Document</title>
    <style>
        p {
            margin: 0;
        }

        img {
            height: 300px;
            width: 500px;
        }
    </style>

</head>

<body>

    <b>ตัวดำเนินการ (Operator)</b>
    <p>กลุ่มของเครื่องหมายหรทอสัญลักษณ์ทีาใช้ในการเขียนโปรแกรม A+B</p>
    <p>1.ตัวดำเนินการ(Operator)</p>
    <p>2.ตัวถูกดำเนินการ(Operand)</p>

    <img src="/php/img/Op1.png"><br>
    <p>---------------------------------------------------------------------------------------</p><br>
    <?php

    $a = 10;
    $b = 2;
    echo "a = $a b = $b" . "<br>";
    echo "a  + b  = " . $c = ($a + $b) . "<br>";
    echo "a  - b  = " . $c = ($a - $b) . "<br>";
    echo "a  * b  = " . $c = ($a * $b) . "<br>";
    echo "a  / b  = " . $c = ($a / $b) . "<br>";
    echo "a  % b  = " . $c = ($a % $b) . "<br>";
    ?>

    <p>---------------------------------------------------------------------------------------</p><br>
    <img src="/php/img/Op2.png"><br>
    <?php
    echo var_dump($a == $b) . "<br>";
    echo "ผลการเปรียบเทียบ " . ($a == $b) . "<br>";
    echo "ผลการเปรียบเทียบ " . ($a === $b) . "<br>";
    echo "ผลการเปรียบเทียบ " . ($a != $b) . "<br>";
    echo "ผลการเปรียบเทียบ " . ($a <> $b) . "<br>";
    echo "ผลการเปรียบเทียบ " . ($a !== $b) . "<br>";
    echo "ผลการเปรียบเทียบ " . ($a < $b) . "<br>";
    echo "ผลการเปรียบเทียบ " . ($a > $b) . "<br>";
    echo "ผลการเปรียบเทียบ " . ($a >= $b) . "<br>";
    echo "ผลการเปรียบเทียบ " . ($a <= $b) . "<br>";
    echo "ผลการเปรียบเทียบ " . ($a <=> $b) . "<br>";

    ?>

    <p>---------------------------------------------------------------------------------------</p><br>

    <?php
    echo "เพิ่มค่าแบบ ++(Perfix) " . ++$a . "<br>";
    echo "ลดค่าแบบ --(Perfix) " . --$a . "<br>";
    echo "เพิ่มค่าแบบ (Postfix)++ " . $a++ . "<br>";
    echo "ลดค่าแบบ --(Postfix)++ " . $a-- . "<br>";
    echo $a . "<br>";
    ?>
    <p>---------------------------------------------------------------------------------------</p><br>
    <img src="/php/img/Op3.png"><br>

</body>

</html>